# Задача 4. Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

quarter = int(input('Введите номер четверти плоскости: '))
p1 = '(- ∞; 0)'
p2 = '(0; + ∞)'

if quarter == 1:
    print(f'диапазон координат точки в 1 четверти  x є {p2} ⋃ y є {p2}')
elif quarter == 2:
    print(f'диапазон координат точки во 2 четверти  x є {p1} ⋃ y є {p2}')
elif quarter == 3:
    print(f'диапазон координат точки в 3 четверти  x є {p1} ⋃ y є {p1}')
elif quarter == 4:
    print(f'диапазон координат точки в 4 четверти  x є {p2} ⋃ y є {p1}')   
else:
    print('Введены некорректные значения номера четверти')